// Задание 1: 
// 1. Создать две переменные и спросить у пользователя значения для данных 
// переменных. Одна переменная будет хранить имя пользователя, другая его возраст.
// 2. Вывести на экран текст: 
// “Добро пожаловать, `имя`. Ваше количество оборотов вокруг солнца - `возраст`.”
// Тайминг: 15 минут.
const userName = prompt("Введите Ваше имя:");
const age = prompt("Введите Ваш возраст: ");
console.log(`Добро пожаловать, ${userName}`);
console.log(`Ваше количество оборотов вокруг солнца - ${age}`);

