<script>
export default {}
</script>

<template>

  <div class="text-container padd">
    <h1>Наши короткие URL-адреса<br>
      абсолютно бесплатны и безопасны.<br>
      Это очень удобно и просто!</h1>
    <p>С помощью нашего бесплатного и универсального сервиса сокращения URL можно сделать из длинной ссылки
      короткую, или просто - сократить или укоротить ссылку. Короткие ссылки удобно отсылать в сообщениях или
      комментариях на facebook, instagram, twitter, vk, whatsapp, telegram или любом другом сервисе или сайте.</p>
    <p>Длинные ссылки выглядят неэстетично, часто ими неудобно пользоваться. Короткие ссылки смотрятся лучше, их
      легко диктовать, но иногда сокращение url может привести к неприятным последствиям.</p>
    <h2>Когда стоит сократить ссылку?</h2>
    <h3>Короткий url стоит использовать, если нужно:</h3>
    <ul>
      <li>переслать ссылку в мессенджере, по SMS или продиктовать;</li>
      <li>замаскировать реферальные ссылки;</li>
      <li>сделать ссылку визуально привлекательной — для рекламных материалов;</li>
      <li>экономить место в ограниченных по длине сообщениях — например, в SMS;</li>
      <li>предотвратить неверное копирование (обрезание) длинных ссылок;</li>
    </ul>
    <h2>Когда сокращение ссылок не уместно?</h2>
    <h3>Не стоит передавать сокращенную ссылку:</h3>
    <ul>
      <li>в письмах — из-за коротких ссылок письма попадают в спам;</li>
      <li>для страниц сайта — когда сокращатель ссылок перестанет работать, придется менять ссылки;</li>
      <li>если нужна вечно работающая ссылка — причина выше.</li>
    </ul>
    <p>Помогите клиентам быстро найти вашу страницу в интернете. Благодаря короткой ссылке клиентам не придётся
      видеть длинные url-адреса, занимающие много места.</p>
  </div>

</template>

<style scoped>
.padd {
  padding: 60px 0;
}

h1 {
  line-height: normal;
}
</style>